### 📋 Terraform Plan: `aws/dfbx/eu-south-2/labs/hands-on-datadog/parameter-store/DD_API_KEY`

✅ **Plan Status:** Success
⚠️ **Format Check:** Failed (non-blocking)

<details><summary>📄 Plan Output</summary>

```terraform
[0;90m01:34:45.530[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m01:34:45.530[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m01:34:45.530[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m01:34:45.530[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_ssm_parameter.this[0] will be created
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_ssm_parameter" "this" {
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn              = (known after apply)
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + data_type        = (known after apply)
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description      = "DataDog API Key for labs environment"
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + has_value_wo     = (known after apply)
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id               = (known after apply)
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + insecure_value   = (known after apply)
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + key_id           = (known after apply)
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name             = "/labs/datadog/DD_API_KEY"
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region           = "eu-south-2"
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags             = {
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:34:45.531[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "parameter-store"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all         = {
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "role"        = "parameter-store"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tier             = (known after apply)
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type             = "SecureString"
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + value            = (sensitive value)
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + value_wo         = (write-only attribute)
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + value_wo_version = 1
[0;90m01:34:45.532[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + version          = (known after apply)
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 1 to add, 0 to change, 0 to destroy.
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + insecure_value        = (known after apply)
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + raw_value             = (sensitive value)
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + secure_type           = true
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + secure_value          = (sensitive value)
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ssm_parameter_arn     = (known after apply)
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ssm_parameter_name    = "/labs/datadog/DD_API_KEY"
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ssm_parameter_type    = "SecureString"
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ssm_parameter_version = (known after apply)
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + value                 = (known after apply)
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0mNote: You didn't use the -out option to save this plan, so Terraform can't
[0;90m01:34:45.533[0m [0;37mSTDOUT[0m [0;36mterraform: [0mguarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

---
*Workflow: [Terragrunt Plan IaC](https://github.com/darthfabax-org/iac/actions/runs/22651012187)*